app/views/users/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  <% @id = session[:user_id]
	   @user = User.find(@id) if @id != nil %>