app/views/orders/_form.html.erb

<!--       <h2>%= pluralize(@order.errors.count, "error") %> prohibited this order from being saved:</h2> -->
      <%= t('errors.template.header',:count => @order.errors.size,:model => t('activerecord.models.order'))%>:
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1

  <% @id = session[:user_id]
	   @user = User.find(@id) if @id != nil %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1