app/controllers/comments_controller.rb

  def create
    @product = Product.find(params[:product_id])

    @comment = Comment.new(params[:new_comment])
    @comment.update_attribute('product_id',@product.id)

    @comments = Comment.paginate:page=>params[:page],
                                  :order => 'created_at DESC',
                                  :conditions =>["product_id = :pid",{:pid => @product.id}],
                                  :per_page => @@per_page
    @comment_flag = true

    respond_to do |format|
      if @comment.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
SELECT "comments".* FROM "comments" WHERE (product_id = 2) ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE (product_id = 2)
INSERT INTO "comments" ("user_id", "content", "created_at", "updated_at", "product_id") VALUES (NULL, '34523452345', '2011-08-01 07:54:54.531250', '2011-08-01 07:54:54.531250', 2)

  def create_for_product_show
    @show_product = Product.find(params[:product_id])

    @comment = Comment.new(params[:new_comment])
    @comment.update_attribute('product_id',@show_product.id)

    @comments = Comment.paginate:page=>params[:page],
                                  :order => 'created_at DESC',
                                  :conditions =>["product_id = :pid",{:pid => @show_product.id}],
                                  :per_page => @@per_page
    @comment_flag = true

    respond_to do |format|
      if @comment.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 3 LIMIT 1
SELECT "comments".* FROM "comments" WHERE (product_id = 3) ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE (product_id = 3)
INSERT INTO "comments" ("created_at", "user_id", "content", "product_id", "updated_at") VALUES ('2011-08-04 06:22:37.142578', NULL, '121321312', 3, '2011-08-04 06:22:37.142578')

  def update
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 980190962 LIMIT 1

  def show_comments
    @product = Product.find(params[:product_id])
#    @comments = Comment.where(:product_id => @product.id)
#    @comments = Comment.find(:all,:conditions =>["product_id = :pid",{:pid => @product.id}])
    @comments = Comment.paginate:page=>params[:page],
                                  :order => 'created_at DESC',
                                  :conditions =>["product_id = :pid",{:pid => @product.id}],
                                  :per_page => @@per_page
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."order" = 'time_created' AND "comments"."product_id" = 2
SELECT COUNT(*) FROM "comments" WHERE (product_id = 2)

  def hide_comments
    @comment_flag = false
    @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1