app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
#    @line_item = @cart.line_items.build(:product => product)
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-14 17:37:35.593750', '2011-07-14 17:37:35.593750')
INSERT INTO "line_items" ("updated_at", "quantity", "order_id", "product_id", "cart_id", "created_at") VALUES ('2011-08-05 01:20:48.380859', 1, NULL, 207281424, 980190963, '2011-08-05 01:20:48.380859')
UPDATE "line_items" SET "updated_at" = '2011-07-14 17:33:05.890625', "quantity" = 3 WHERE "line_items"."id" = 1

  def destroy
    @cart = current_cart
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 39 LIMIT 1
DELETE FROM "line_items" WHERE "line_items"."id" = 39

  def increase_quantity
    @cart = current_cart
    @line_item = LineItem.find(params[:id])
    q = @line_item.quantity += 1
    @line_item.update_attribute('quantity',q)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 46 LIMIT 1
UPDATE "line_items" SET "updated_at" = '2011-07-30 06:16:02.734375', "quantity" = 3 WHERE "line_items"."id" = 52

  def decrease_quantity
    @cart = current_cart
    @line_item = LineItem.find(params[:id])
    if @line_item.quantity > 1
      q = @line_item.quantity -= 1
      @line_item.update_attribute('quantity',q)
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 48 LIMIT 1
UPDATE "line_items" SET "updated_at" = '2011-07-30 10:44:51.015625', "quantity" = 1 WHERE "line_items"."id" = 52