app/controllers/orders_controller.rb

  def index
#    @orders = Order.all
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def new
    if current_cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 10)

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil

        Notifier.order_received(@order).deliver
---
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-21 16:37:24.125000', '2011-07-21 16:37:24.125000')
INSERT INTO "orders" ("updated_at", "address", "name", "pay_type", "created_at", "email") VALUES ('2011-08-01 08:46:48.000000', 'MyText', 'Dave Thomas', 'Check', '2011-08-01 08:46:48.000000', 'dave@example.org')
DELETE FROM "carts" WHERE "carts"."id" = 12
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 980190963)