app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
SELECT "comments".* FROM "comments" WHERE (product_id = 2) ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE (product_id = 2)
---
  def show
    @show_product = Product.find(params[:id])
    @comments = Comment.paginate:page=>params[:page],
                                  :order => 'created_at DESC',
                                  :conditions =>["product_id = :pid",{:pid => @show_product.id}],
                                  :per_page => @@per_page

INSERT INTO "products" ("title", "score_number", "created_at", "score", "image_url", "price", "description", "updated_at") VALUES ('Lorem Ipsum', 0, '2011-08-05 01:20:50.037109', 0.0, 'lorem.jpg', 19.95, 'Wibbles fun!', '2011-08-05 01:20:50.037109')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
UPDATE "products" SET "title" = 'Lorem Ipsum', "price" = 19.95, "description" = 'Wibbles fun!', "updated_at" = '2011-08-05 01:42:01.907226', "image_url" = 'lorem.jpg' WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 980190962
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
---
  def who_bought
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2011-08-02 09:29:57.500000', "score_number" = 1 WHERE "products"."id" = 2
---
  def change_score
    @product = Product.find(params[:id])
    @comment_flag = false

    score = params[:score]
    total_score = @product.score_number * @product.score
    total_score += score.to_f

    number = @product.score_number + 1
    @product.update_attribute('score_number',number)

SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2011-08-03 02:40:58.078125', "score_number" = 27 WHERE "products"."id" = 2
SELECT "comments".* FROM "comments" WHERE (product_id = 2) ORDER BY created_at DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE (product_id = 2)
---
  def change_score_for_show
    @show_product = Product.find(params[:id])

    score = params[:score]
    total_score = @show_product.score_number * @show_product.score
    total_score += score.to_f

    number = @show_product.score_number + 1
    @show_product.update_attribute('score_number',number)

    @show_product.update_attribute('score',(total_score/number).round(2))

    @comments = Comment.paginate:page=>params[:page],
                                  :order => 'created_at DESC',
                                  :conditions =>["product_id = :pid",{:pid => @show_product.id}],
                                  :per_page => @@per_page