app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    if params[:set_locale]
      redirect_to store_path(:locale => params[:set_locale])
    else
      @products = Product.paginate:page=>params[:page],
                                  :order => 'created_at DESC',
                                  :per_page => @@per_page