app/controllers/users_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("salt", "realname", "phone", "created_at", "name", "updated_at", "email", "authority", "address", "hashed_password") VALUES ('508870800.476459292393401', NULL, NULL, '2011-08-05 01:42:03.079101', 'sam', '2011-08-05 01:42:03.079101', NULL, 'f', NULL, 'fc386084e3d2cf04faf4ccc9453e984e5d3921e9a427fdba9c2aca8556cf3e1e')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "salt" = '412657080.008475995377071', "name" = 'sam', "updated_at" = '2011-08-05 01:42:03.532226', "hashed_password" = '62b6e5e837b083aca17b929e684ccb46fdffecb74aac080bdffefd89271e976c' WHERE "users"."id" = 980190962